vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXE317_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="camera-device-ov7725" Cversion="1.0.1" condition="driver.camera-device-ov7725.condition_id">
      <description>Driver camera-device-ov7725</description>
      <files>
        <file category="header" name="components/video/camera/device/ov7725/fsl_ov7725.h" projectpath="video"/>
        <file category="sourceC" name="components/video/camera/device/ov7725/fsl_ov7725.c" projectpath="video"/>
        <file category="include" name="components/video/camera/device/ov7725/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="camera-device-sccb" Cversion="1.0.1" condition="driver.camera-device-sccb.condition_id">
      <description>Driver camera-device-sccb</description>
      <RTE_Components_h>
        #ifndef SDK_I2C_BASED_COMPONENT_USED
        #define SDK_I2C_BASED_COMPONENT_USED 1
        #endif
      </RTE_Components_h>
      <files>
        <file category="header" name="components/video/camera/device/sccb/fsl_sccb.h" projectpath="video"/>
        <file category="sourceC" name="components/video/camera/device/sccb/fsl_sccb.c" projectpath="video"/>
        <file category="include" name="components/video/camera/device/sccb/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="camera-receiver-common" Cversion="1.0.0" condition="driver.camera-receiver-common.condition_id">
      <description>Driver camera-receiver-common</description>
      <files>
        <file category="header" name="components/video/camera/receiver/fsl_camera_receiver.h" projectpath="video"/>
        <file category="include" name="components/video/camera/receiver/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="clock" Cversion="2.1.2" condition="driver.clock.condition_id">
      <description>Clock Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXE317/drivers/fsl_clock.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXE317/drivers/fsl_clock.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXE317/drivers/"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="I2C" Csub="lpi2c_cmsis" Cversion="2.6.0" Capiversion="2.3.0" condition="driver.cmsis_lpi2c.condition_id">
      <description>LPI2C CMSIS Driver</description>
      <files>
        <file category="header" name="devices/MCXE317/cmsis_drivers/fsl_lpi2c_cmsis.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXE317/cmsis_drivers/fsl_lpi2c_cmsis.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXE317/cmsis_drivers/"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="SPI" Csub="lpspi_cmsis" Cversion="2.12.0" Capiversion="2.2.0" condition="driver.cmsis_lpspi.condition_id">
      <description>LPSPI CMSIS Driver</description>
      <files>
        <file category="header" name="devices/MCXE317/cmsis_drivers/fsl_lpspi_cmsis.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXE317/cmsis_drivers/fsl_lpspi_cmsis.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXE317/cmsis_drivers/"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USART" Csub="lpuart_cmsis" Cversion="2.7.0" Capiversion="2.3.0" condition="driver.cmsis_lpuart.condition_id">
      <description>LPUART CMSIS Driver</description>
      <files>
        <file category="header" name="devices/MCXE317/cmsis_drivers/fsl_lpuart_cmsis.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXE317/cmsis_drivers/fsl_lpuart_cmsis.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXE317/cmsis_drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cmu_fc" Cversion="2.0.1" condition="driver.cmu_fc.condition_id">
      <description>cmu_fc Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXE317/drivers/fsl_cmu_fc.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXE317/drivers/fsl_cmu_fc.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXE317/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cmu_fm" Cversion="2.0.1" condition="driver.cmu_fm.condition_id">
      <description>cmu_fm Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXE317/drivers/fsl_cmu_fm.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXE317/drivers/fsl_cmu_fm.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXE317/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="codec" Cversion="2.3.1" condition="driver.codec.condition_id">
      <description>Driver codec</description>
      <RTE_Components_h>
        #ifndef SDK_I2C_BASED_COMPONENT_USED
        #define SDK_I2C_BASED_COMPONENT_USED 1
        #endif
      </RTE_Components_h>
      <files>
        <file category="header" name="components/codec/fsl_codec_common.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/fsl_codec_common.c" projectpath="codec"/>
        <file category="include" name="components/codec/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="common" Cversion="2.6.0" condition="driver.common.condition_id">
      <description>common Driver</description>
      <files>
        <file category="header" name="devices/MCXE317/drivers/fsl_common.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXE317/drivers/fsl_common.c" projectpath="drivers"/>
        <file condition="allOf.cores=cm7f.condition_id" category="sourceC" name="devices/MCXE317/drivers/fsl_common_arm.c" projectpath="drivers"/>
        <file condition="allOf.cores=cm7f.condition_id" category="header" name="devices/MCXE317/drivers/fsl_common_arm.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXE317/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="crc" Cversion="2.0.4" condition="driver.crc.condition_id">
      <description>CRC Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXE317/drivers/fsl_crc.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXE317/drivers/fsl_crc.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXE317/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dbi" Cversion="1.0.0" condition="driver.dbi.condition_id">
      <description>Driver dbi</description>
      <files>
        <file category="header" name="components/video/display/dbi/fsl_dbi.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/dbi/fsl_dbi.c" projectpath="video"/>
        <file category="include" name="components/video/display/dbi/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dbi_flexio_edma" Cversion="1.0.1" condition="driver.dbi_flexio_edma.condition_id">
      <description>Driver dbi_flexio_edma</description>
      <files>
        <file category="header" name="components/video/display/dbi/flexio/fsl_dbi_flexio_edma.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/dbi/flexio/fsl_dbi_flexio_edma.c" projectpath="video"/>
        <file category="include" name="components/video/display/dbi/flexio/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dc-fb-common" Cversion="1.0.0" condition="driver.dc-fb-common.condition_id">
      <description>Driver dc-fb-common</description>
      <files>
        <file category="header" name="components/video/display/dc/fsl_dc_fb.h" projectpath="video"/>
        <file category="include" name="components/video/display/dc/"/>
      </files>
    </component>
