vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXE317_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="video-i2c" Cversion="1.0.1" condition="driver.video-i2c.condition_id">
      <description>Driver video-i2c</description>
      <RTE_Components_h>
        #ifndef SDK_I2C_BASED_COMPONENT_USED
        #define SDK_I2C_BASED_COMPONENT_USED 1
        #endif
      </RTE_Components_h>
      <files>
        <file category="header" name="components/video/i2c/fsl_video_i2c.h" projectpath="video"/>
        <file category="sourceC" name="components/video/i2c/fsl_video_i2c.c" projectpath="video"/>
        <file category="include" name="components/video/i2c/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wkpu" Cversion="2.0.0" condition="driver.wkpu.condition_id">
      <description>Wakeup Unit Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXE317/drivers/fsl_wkpu.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXE317/drivers/fsl_wkpu.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXE317/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="xbic" Cversion="2.0.1" condition="driver.xbic.condition_id">
      <description>xbic Driver</description>
      <files>
        <file category="header" name="devices/MCXE317/drivers/fsl_xbic.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXE317/drivers/fsl_xbic.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXE317/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="xrdc" Cversion="2.0.7" condition="driver.xrdc.condition_id">
      <description>XRDC Driver</description>
      <files>
        <file category="header" name="devices/MCXE317/drivers/fsl_xrdc.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXE317/drivers/fsl_xrdc.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXE317/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="baremetal" Cversion="1.0.0" condition="middleware.baremetal.condition_id">
      <description>Middleware baremetal</description>
      <RTE_Components_h>
#ifndef SDK_OS_BAREMETAL
#define SDK_OS_BAREMETAL 
#endif
</RTE_Components_h>
      <files>
        <file category="doc" name="middleware/bm/middleware.baremetal_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="misc_utilities" Cversion="1.1.1" condition="utilities.misc_utilities.condition_id">
      <description>
        Utilities which is needed for particular toolchain like the SBRK function required to address limitation between HEAP and STACK in GCC toolchain library.
      </description>
      <files>
        <file condition="allOf.toolchains=armgcc.condition_id" category="sourceC" name="devices/MCXE317/utilities/fsl_syscall_stub.c" projectpath="utilities"/>
        <file condition="allOf.toolchains=armgcc.condition_id" category="sourceC" name="devices/MCXE317/utilities/fsl_sbrk.c" projectpath="utilities"/>
        <file condition="allOf.toolchains=armgcc, mdk, cores=cm7f.condition_id" category="sourceAsm" name="devices/MCXE317/utilities/fsl_memcpy.S" projectpath="utilities"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="assert" Cversion="1.0.0" condition="utility.assert.condition_id">
      <description>Utility assert</description>
      <files>
        <file category="header" name="devices/MCXE317/utilities/debug_console/fsl_assert.h" projectpath="utilities"/>
        <file category="sourceC" name="devices/MCXE317/utilities/debug_console/fsl_assert.c" projectpath="utilities"/>
        <file category="include" name="devices/MCXE317/utilities/debug_console/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="assert_lite" Cversion="1.0.0" condition="utility.assert_lite.condition_id">
      <description>Utility assert_lite</description>
      <files>
        <file category="header" name="devices/MCXE317/utilities/debug_console_lite/fsl_assert.h" projectpath="utilities"/>
        <file category="sourceC" name="devices/MCXE317/utilities/debug_console_lite/fsl_assert.c" projectpath="utilities"/>
        <file category="include" name="devices/MCXE317/utilities/debug_console_lite/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console" Cversion="1.0.1" condition="utility.debug_console.condition_id">
      <description>Utility debug_console</description>
      <files>
        <file category="header" name="devices/MCXE317/utilities/debug_console/fsl_debug_console.h" projectpath="utilities/debug_console"/>
        <file category="sourceC" name="devices/MCXE317/utilities/debug_console/fsl_debug_console.c" projectpath="utilities/debug_console"/>
        <file category="include" name="devices/MCXE317/utilities/debug_console/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console_lite" Cversion="1.0.0" condition="utility.debug_console_lite.condition_id">
      <description>Utility debug_console_lite</description>
      <files>
        <file category="header" name="devices/MCXE317/utilities/debug_console_lite/fsl_debug_console.h" projectpath="utilities/debug_console_lite"/>
        <file category="sourceC" name="devices/MCXE317/utilities/debug_console_lite/fsl_debug_console.c" projectpath="utilities/debug_console_lite"/>
        <file category="include" name="devices/MCXE317/utilities/debug_console_lite/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="debug console template config" Cversion="1.0.0" condition="utility.debug_console_template_config.condition_id">
      <description>Utility debug_console Template Config</description>
      <files>
        <file category="header" attr="config" name="devices/MCXE317/utilities/debug_console/config/fsl_debug_console_conf.h" version="1.0.0" projectpath="utilities/debug_console/config"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="incbin" Cversion="1.0.0" condition="utility.incbin.condition_id">
      <description>Used to include slave core binary into master core binary.</description>
      <files>
        <file condition="allOf.toolchains=armgcc, mdk.condition_id" category="sourceAsm" name="devices/MCXE317/utilities/incbin/fsl_incbin.S" projectpath="utilities"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="notifier" Cversion="1.0.0" condition="utility.notifier.condition_id">
      <description>Utility notifier</description>
      <files>
        <file category="sourceC" name="devices/MCXE317/utilities/fsl_notifier.c" projectpath="utilities/utilities"/>
        <file category="header" name="devices/MCXE317/utilities/fsl_notifier.h" projectpath="utilities/utilities"/>
        <file category="include" name="devices/MCXE317/utilities/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="shell" Cversion="1.0.0" condition="utility.shell.condition_id">
      <description>Utility shell</description>
      <files>
        <file category="header" name="devices/MCXE317/utilities/shell/fsl_shell.h" projectpath="utilities"/>
        <file category="sourceC" name="devices/MCXE317/utilities/shell/fsl_shell.c" projectpath="utilities"/>
        <file category="include" name="devices/MCXE317/utilities/shell/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="str" Cversion="1.0.0" condition="utility.str.condition_id">
      <description>Utility str</description>
      <files>
        <file category="header" name="devices/MCXE317/utilities/str/fsl_str.h" projectpath="utilities/str"/>
        <file category="sourceC" name="devices/MCXE317/utilities/str/fsl_str.c" projectpath="utilities/str"/>
        <file category="include" name="devices/MCXE317/utilities/str/"/>
      </files>
    </component>
  </components>
</package>